import os
from dotenv import load_dotenv

load_dotenv()


TOKEN = os.getenv("DISCORD_TOKEN")

GUILD_ID = 1542284878739939528
PREFIX = "!"

OWNERSHIP_ROLE_ID        = 1542284878815567909
MANAGER_ROLE_ID          = 1542284878807040112
STAFF_ROLE_ID            = 1542284878790271034
DEVELOPER_ROLE_ID        = 1542284878798655662
CIVILIAN_MANAGER_ROLE_ID = 1542284878798655667
CRIMINAL_MANAGER_ROLE_ID = 1542284878798655667
DONATE_MANAGER_ROLE_ID   = 1542284878798655670
FOUNDER_ROLE_ID          =  1542284878815567911
STAFF_MANAGER_ID         = 1542284878798655669
FEMALE_MANAGER_ID = 1542284878798655665
EVENT_MANAGER_ID = 1542284878798655668
GENERAL_MANAGER_ID = 1542284878807040113
APPLICATION_ACCEPTED_ROLES = {
    "staff": 1542284878769291303  , 
    "manager":  1542284878769291303,  
    "criminal": 1542284878769291303 ,
}

APPLICATION_REVIEW_ROLES = {
    "elas": [1542284878769291301],
    "ekab": [1542284878769291300],
    "dikastiko": [1542284878769291299],
    "staff": [OWNERSHIP_ROLE_ID],
    "manager": [OWNERSHIP_ROLE_ID],
    "criminal": [OWNERSHIP_ROLE_ID],
}
SERVER_ORG_ID = 1542284878807040114

STAFF_TEAM_ROLE_IDS = [STAFF_ROLE_ID, MANAGER_ROLE_ID, OWNERSHIP_ROLE_ID]

TICKET_SUPPORT_CHANNEL_ID =  1542284880900268192
TICKET_SUPPORT_BANNER_URL = "https://i.imgur.com/tIlS976.jpeg"
TICKET_SUPPORT_THUMBNAIL_URL = "https://i.imgur.com/TOo1WCC.png"

CAT_TICKET_OWNERSHIP_ID = 1542284882028273793
CAT_TICKET_SUPPORT_ID   = 1542284881801904215
CAT_TICKET_ANTICHEAT_ID = 1542284881801904216
CAT_TICKET_REWARD_ID    = 1542553074961485884
CAT_TICKET_REPORT_STAFF_ID = 1542284879255838806
CAT_TICKET_REPORT_MANAGER_ID = 1542284879255838805
CAT_TICKET_REPORT_OWNERSHIP_ID = 1542284879255838804

REPORT_PANEL_BANNER_URL = "https://i.imgur.com/qaCEDaG.jpeg"
CAT_JOBS_ID = 1542284882028273787

TICKET_JOBS_BANNER_URL = "https://i.imgur.com/qaCEDaG.jpeg"
TICKET_JOBS_THUMBNAIL_URL = "https://i.imgur.com/TOo1WCC.png"


CAT_DONATE_ID = 1542553403954298980

TICKET_DONATE_BANNER_URL = "https://i.imgur.com/qaCEDaG.jpeg"
TICKET_DONATE_THUMBNAIL_URL = "https://i.imgur.com/TOo1WCC.png"

STAFF_PING_CHANNEL_ID =  1542553588994408570


LOG_TICKETS_CHANNEL_ID =  1542284879704621094
TICKET_NOTIFIER_CHANNEL_ID = 1542284879704621094

SUGGESTIONS_CHANNEL_ID =    1542284881126498391


SUPPORT_VOICE_CHANNEL_ID = 1542284880900268197

SUPPORT_VOICE_NOTIFIER_CHANNEL_ID = 1542553588994408570
SUPPORT_VOICE_PING_ROLE_ID = 1542284878790271034

LOG_APPLICATIONS_CHANNEL_ID = 1542284880132448277


LOG_APPLICATIONS_CHANNEL_IDS = {
    "elas": 1542284880132448278    , 
    "ekab":   1542284880132448279  , 
    "dikastiko": 1542284880132448280 ,
    "staff":  1542284880132448277  ,  
    "manager": 1542284880132448277 ,   
    "criminal": 1542284880132448281,
}

APPLICATION_ANNOUNCE_CHANNEL_IDS = {
    "elas": 1542284881801904209,
    "ekab": 1542284881801904210,
    "dikastiko":1542284881801904211 ,
    "staff": 1542284881801904208 ,
}

APPLICATION_ANNOUNCE_MENTION_CHANNEL_ID = 1542284881357312118

APPLICATION_ANNOUNCE_STAFF_MENTION_CHANNEL_ID = 1542284880900268195


INVITE_LOG_CHANNEL_ID =  1542284880132448284


LOG_UNTIMEOUT_CHANNEL_ID    = 1542284879927050338

APPLICATIONS_PANEL_CHANNEL_ID = 1542284881583669253
APPLICATIONS_CATEGORY_ID      = 1542756389896720435
APPLICATIONS_BANNER_URL = "https://i.imgur.com/lzDSDeT.jpeg"

LOG_GIVEAWAY_CHANNEL_ID =  1542284879927050340
GIVEAWAY_BANNER_URL = "https://i.imgur.com/qaCEDaG.jpeg" 

LOG_WARN_CHANNEL_ID = 1542284880132448276
WARN_ANNOUNCE_CHANNEL_ID =  1542284880514256935

WARN_ROLE_1_ID = 1542284878790271029
WARN_ROLE_2_ID =   1542284878790271028
WARN_ROLE_3_ID =  1542284878777811055


WHITELIST_CATEGORY_ID = 1542284879255838807           
LOG_WHITELIST_CHANNEL_ID = 1542284880132448282         
WHITELIST_ACCEPTED_ROLE_ID =  1542284878756843550     
WHITELIST_BANNER_URL = "https://i.imgur.com/qaCEDaG.jpeg"      
WHITELIST_LINK_URL = "https://www.roblox.com/share/g/120555068"   
WHITELIST_LINK_LABEL = "Join Now" 
WHITELIST_LINK_TEXT = "Για να μπείς στο game μας θα πρέπει αναγκαστικά να είσαι μέλος του roblox group. Πάτα το κουμπί **Join Now** για να γίνεις μέλος." 

WHITELIST_QUESTIONS = [
    "Τι ηλικία έχει το roblox account σου?",
    "Ποιο είναι το Roblox Name σου?",
    "Εισαι μέλος του roblox group?",
    "Γιατί θέλεις να μπεις στον server?",
    "Έχεις διαβάσει τους κανόνες του server?",
    "Πες μας λίγα λόγια για το backstory του χαρακτήρα σου (in game).",
]

APPLICATION_TYPES = {
    "elas": {
        "label": "ΕΛ.ΑΣ",
        "questions": [
            "Πόσο χρονών είστε;",
            "Ποιο είναι το Roblox Name σας;",
            "Έχετε εμπειρία σαν Αστυνομικός σε άλλη πόλη ? (Αν ναι. Σε ποια πόλη και μέχρι τι θέση)?.",
            "Το ονοματεπώνυμο σας (RP)?.",
            "Πόσες ώρες θα μπορείτε να διαθέτετε καθημερινά σαν Αστυνομικός?.",
            "Γιατί θέλετε να ενταχθείτε στο σώμα της Ελληνικής Αστυνομίας?.",
            "Έχετε ποινικό μητρώο στην ΕΛ.ΑΣ? (in game).",
            "Πείτε μας μερικά από τα αρνητικά χαρακτηριστικά σας.",
            "Εάν έχετε έναν αντιδραστικό πολίτη στα κελιά πως θα τον ηρεμήσετε?.",
            "Καθώς είσαι σε περιπολία, βλέπεις δυο πολίτες να παλεύουν στο πεζοδρόμιο. Αφού τους περάσεις χειροπέδες, σου δίνουν και οι δύο την ίδια κατάθεση: πως ήταν σε άμυνα, και πως ο άλλος το άρχισε. Πώς χειρίζεσαι την κατάσταση?.",
            "Ανάμεσα σε 2 ζωές την δικιά σας και ενός πολίτη, ποία ζωή θα έπρεπε να διασφαλιστεί πρώτη και γιατί?.",
            "Ποιος πιστεύετε πως είναι ο ρόλος του διαπραγματευτή?.",
            "Είστε σε σκηνικό ομηρίας ενός πολίτη και ένας ανώτερος σας σας λέει να ανοίξετε πυρ ενώ εσείς ξέρετε πως είναι λάθος και μπορεί να είναι μοιραίο. Πως θα πράξετε στην προκειμένη περίπτωση?.",
            "Ένα βαν με φιμέ τζάμια είναι παρκαρισμένο έξω από ένα σπίτι στο οποίο επιβαίνουν 4 άτομα. Παρατηρείς ένα άτομο με full face να βγαίνει από το αμάξι και να κρατάει ένα Uzi. Σύντομα, ο ύποπτος επιστρέφει στο βαν και φεύγει με μεγάλη ταχύτητα. Πώς χειρίζεσαι την κατάσταση?.",
            "Ποιο είναι το πρώτο όπλο ενός αστυνομικού?",
            "Κάνεις ένα μαύρο όχημα traffic stop πες μου τις κινήσεις σου και τα λόγια σου?.",
            "Είσαι σε ληστεία και κάνεις την διαπραγμάτευση και ο ανώτερος σου λέει να πυροβολήσεις εκείνη την στιγμή τι θα έκανες?.",
            "Τι λέει το άρθρο 361",
            "Έχετε να προσθέσετε κάτι άλλο"
        ],
    },
    "ekab": {
        "label": "ΕΚΑΒ",
        "questions": [
            "Πόσο χρονών είστε;",
            "Ποιο είναι το Roblox Name σας;",
            "Ποιο είναι το πραγματικό όνομα σας;",
            "Γιατί θέλεις να μπεις στο ΕΚΑΒ",
            "Έχεις εμπειρία από ιατρικούς ρόλους σε άλλους RP servers",
            "Τι σε κάνει κατάλληλο άτομο για διασώστη",
            "Πώς θα χειριζόσουν έναν τραυματία που δεν συνεργάζεται",
            "Πώς αντιμετωπίζεις παίκτη που κάνει failRP σε ιατρική σκηνή",
            "Πώς θα αντιδρούσες σε σοβαρό τροχαίο με πολλούς τραυματίες",
            "Τι θεωρείς ως σωστό ιατρικό RP",
            "Πώς θα χειριζόσουν παίκτη που σε βρίζει ενώ προσπαθείς να τον βοηθήσεις",
            "Τι θα έκανες αν δεις συνάδελφο να κάνει λάθος ή να παραβιάζει κανόνες",
            "Ποιος είναι ο ρόλος του ΕΚΑΒ μέσα στο RP",
        ],
    },
   "dikastiko":{
       "label": "Δικαστικό μέγαρο",
       "questions": [
           "Πόσο χρονών είσαι;",
           "Πως σε λένε στο Roblox;",
           "Ποιο είναι το πραγματικό όνομα σας;",
           "Τι αρμοδιότητες έχει ένας δικαστής;",
           "Ποια είναι η διαφορά μεταξύ κατηγορουμένου και ενόχου;",
           "Τι θεωρείται αποδεικτικό στοιχείο;",
           "Πότε μπορεί να απορριφθεί ένα αποδεικτικό στοιχείο;",
           "Τι πρέπει να κάνει ο δικαστής αν οι δύο πλευρές διαφωνούν έντονα;",
           "Ποιος έχει το δικαίωμα να καταθέσει στοιχεία στο δικαστήριο;",
           "Τι σημαίνει αμεροληψία;",
           "Πώς θα αντιμετώπιζες έναν παίκτη που διακόπτει συνεχώς τη διαδικασία;",
           "Αν ένας φίλος σου είναι κατηγορούμενος, θα μπορούσες να αναλάβεις την υπόθεση; Γιατί;",
           "Τι θα έκανες αν ένας δικηγόρος προσέβαλλε τον δικαστή;",
           "Πότε πρέπει να λήξει μια δίκη;",
       ],
   },
    "staff": {
        "label": "Staff",
        "questions": [
            "Πόσο χρονών είσαι;",
            "Πως σε λένε στο Roblox;",
            {"type": "yesno", "text": "Ξέρεις ότι θα πρέπει να γράψεις την αίτηση σου στα ελληνικά και όχι greeklish αλλιώς θα απορριφθεί;"},
            {"type": "yesno", "text": "Ξέρεις ότι άμα στείλεις κάποιο προσωπικό μήνυμα σε κάποιον ανώτερο θα απορριφθεί κατευθείαν η αίτηση σου"},
            "Πόσες ώρες θα μπορείς να είσαι on duty;",
            "Είστε διατεθειμένος/η να μειώσετε ώρες από το rp σας για της ανάγκες του staff™;",
            "Έχετε τυχών γνώσεις στα staff commands;",
            "Έχετε ξανά δουλέψει σαν staff; Και αν ναι σε ποιους servers;",
            "Τι σημαίνει ιεραρχία;",
            "Αν κάποιος κάνει livestream και κάνει report ποιος θα πάει;",
            "Ένας φίλος σου παραβιάζει κανόνα ενώ είσαι Staff. Πώς ενεργείς;",
            "Ένας παίκτης σε βρίζει επειδή του έδωσες punishment. Τι κάνεις;",
            "Βλέπεις άλλο Staff να κάνει abuse των permissions του. Πώς το χειρίζεσαι;",
            "Ένας παίκτης έχει δίκιο, αλλά είναι γνωστός σου. Θα αλλάξεις την απόφασή σου;",
            "Ένας παίκτης κάνει report εναντίον σου. Ποιος πρέπει να χειριστεί το report;",
            "Τι θεωρείς Staff Abuse;",
            "Πότε δικαιολογείται Warn, Kick, Temp Ban και Permanent Ban;",
            "Ένας παίκτης παραβιάζει κανόνα αλλά δεν έχεις αρκετά evidence. Τι κάνεις;",
            "Αν ένας ανώτερος Staff σου ζητήσει να τιμωρήσεις κάποιον χωρίς evidence, τι κάνεις;",
            "Τι σημαίνει professionalism για έναν Staff;",
        ],
    },
    "manager": {
        "label": "Manager",
        "questions": [
            "Πόσο χρονών είστε;",
            "Ποιο είναι το Roblox Name σας;",
            {"type": "yesno", "text": "Ξέρεις ότι θα πρέπει να γράψεις την αίτηση σου στα ελληνικά και όχι greeklish αλλιώς θα απορριφθεί;"},
            {"type": "yesno", "text": "Ξέρεις ότι άμα στείλεις κάποιο προσωπικό μήνυμα σε κάποιον ανώτερο θα απορριφθεί κατευθείαν η αίτηση σου"},
            "Ένα πράγμα που θα άλλαζες στη δομή του server & γιατί",
            "Πώς αξιολογείς αν ένας staff αξίζει προαγωγή;",
            "Πρέπει να υποβιβάσεις φίλο σου — θα το κάνεις; Πώς;",
            "Server χάνει active players — διαδικασία διάγνωσης;",
            "Disagreement με owner πάνω σε απόφασή του — πώς το χειρίζεσαι;",
            "Πώς θα έφτιαχνες staff team από την αρχή αν το τωρινό διαλυόταν εντελώς; Ποια κριτήρια θα κοιτούσες πρώτα;",
            "Ανακαλύπτεις ότι ένας staff πουλάει in-game πλεονεκτήματα για πραγματικά χρήματα εκτός συστήματος του server. Ποια είναι η ακριβής διαδικασία σου βήμα-βήμα;",
            "Πού βλέπεις το server σε 6 μήνες αν γίνεις manager, με συγκεκριμένα, μετρήσιμα ορόσημα;",
            "Ποιο θα ήταν το πρώτο πράγμα που θα έκανες τις πρώτες 48 ώρες στη θέση;",
            "Δύο staff κατηγορούν ο ένας τον άλλον για κλοπή δεδομένων. Πώς το διερευνάς χωρίς να πάρεις προκατειλημμένη θέση;",
            "Πόσες ώρες θα μπορείς να είσαι on;"
        ],
    },
    "criminal": {
        "label": "Criminal",
        "questions": [
            "Για ποιο Criminal Team ενδιαφέρεστε?",
            "Τι ηλικίες υπάρχουν στην ομάδα σας? [Boss 16+ αυστηρά]",
            "Πόσα μέλη είστε και πόσο καιρό παίζετε criminal ? [Minimum 10 για Mafia/Cartel & minimum 8 για Gang]",
            "Απο ποιόν Server έρχεστε, πόσο καιρό παίζατε και γιατί φύγατε?",
            "Τι σας έκανε να επιλέξετε τον Server μας, ώστε να παίξετε Criminal RP?",
            "Είχατε ποτέ ξανά Criminal Team στον Server μας? Αν ναι γιατι το αφήσατε?",
            "Πόσο ενεργοί θεωρείτε μπορείτε να είστε εφόσον πάρετε την ομάδα?"
            "Είναι σίγουρο πως θα παίζετε με το Job?"
            "Θέλετε να συμπληρώσετε κάτι?"
        ],
    },
}

EMBED_COLOR = int(os.getenv("EMBED_COLOR", "0x9b59b6"), 16)

REVIEWS_PANEL_CHANNEL_ID =  1542284881126498393 
REVIEWS_LOG_CHANNEL_ID =  1542284881126498394 
REVIEWS_BANNER_URL = "https://i.imgur.com/qaCEDaG.jpeg" 

STAFF_COMPLIMENTS_CHANNEL_ID = 1542757197526597702
STAFF_COMPLIMENTS_LOG_CHANNEL_ID = 1542757197526597702
